read_verilog pwm.v
read_verilog -lib ../../../../models/yosys/prim_cells.v

proc;; memory;; techmap;;

dfflibmap -liberty ../../../../models/yosys/prim_cells.lib
abc -liberty ../../../../models/yosys/prim_cells.lib;;

write_spice -neg d_low -pos d_high pwm.mod

