
read_verilog counter.v
read_verilog -lib ../../yosys/prim_cells.v

proc;; memory;; techmap;;

dfflibmap -liberty ../../yosys/prim_cells.lib
abc -liberty ../../yosys/prim_cells.lib;;

write_verilog counter_syn.v
write_spice -neg d_low -pos d_high counter_ngspice.mod
