
read_verilog prsgen8.v
read_verilog -lib ../../yosys/prim_cells.v

proc;; memory;; techmap;;

dfflibmap -liberty ../../yosys/prim_cells.lib
abc -liberty ../../yosys/prim_cells.lib;;

write_verilog prsgen8_syn.v
write_spice -neg 0s -pos 1s prsgen8_ngspice.mod

show
